MCP_Сервер_Выгрузка/InformationRegisters/mcp_ОчередьПроверкиКода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>mcp_ОчередьПроверкиКода</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.mcp_СтатусыПроверкиКода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>context</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>entry_point</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеИмяВременногоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

MCP_Сервер_Выгрузка/Enums/mcp_СтатусыПроверкиКода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>mcp_СтатусыПроверкиКода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

MCP_Сервер_Выгрузка/CommonModules/mcp_ПроверкаКода/Ext/Module.bsl
// Процедура является точкой входа для регламентного задания.
// Она ищет необработанные задания в очереди, выполняет для них
// сборку внешних обработок и обновляет статусы.
//
Процедура НачатьПроверкуКодов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	mcp_ОчередьПроверкиКода.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	mcp_ОчередьПроверкиКода.code КАК code,
	|	mcp_ОчередьПроверкиКода.context КАК context,
	|	mcp_ОчередьПроверкиКода.entry_point КАК entry_point
	|ИЗ
	|	РегистрСведений.mcp_ОчередьПроверкиКода КАК mcp_ОчередьПроверкиКода
	|ГДЕ
	|	mcp_ОчередьПроверкиКода.Статус = ЗНАЧЕНИЕ(Перечисление.mcp_СтатусыПроверкиКода.Ожидает)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
				
		Попытка
			// Подготовка кода с учетом контекста:
			// - объявляем переменные модуля через 'Перем' в начале
			// - присваиваем значения переменным в обработчике 'ПриСозданииОбъекта'
			ДекларацииПеременных = "";
			ПрисваиванияВОбработчике = "";
			ОбъектыДляИнициализации = Новый Соответствие;
			
			Если Не ПустаяСтрока(Выборка.context) И Выборка.context <> "{}" Тогда
				СформироватьКодИнициализацииКонтекста(Выборка.context, ДекларацииПеременных, ПрисваиванияВОбработчике);
			КонецЕсли;
			
			// Базовый код пользователя
			КодПользователя = Выборка.code;
			
			// Добавляем "Экспорт" к вызываемому методу, если его нет
			ИмяМетода = Выборка.entry_point;
			//Если Не ПустаяСтрока(ИмяМетода) Тогда
			//	КодПользователя = ДобавитьЭкспортКМетоду(КодПользователя, ИмяМетода);
			//КонецЕсли;
			
			// Итоговый код: объявления + пользовательский код
			ИтоговыйКод = ДекларацииПеременных + КодПользователя + ПрисваиванияВОбработчике;
			
			// Имя внешней обработки (внутреннее имя объекта в epf)
			ИмяОбработки = "EPF";
			ПутьКФайлу = СоздатьФайлEPF(ИтоговыйКод, ИмяОбработки);
			
			// Код успешно скомпилирован, теперь выполняем его
			//BSLLS:AllowUsingExternalCodeTools
			Защита = Новый ОписаниеЗащитыОтОпасныхДействий;
			Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
			
			ВнешняяОбработкаОбъект = ВнешниеОбработки.Создать(ПутьКФайлу, Ложь, Защита);
			
			ПараметрыВызова = СформироватьПараметрыВызова(ИтоговыйКод, Выборка.entry_point, Выборка.context);
			СтрокаВызова = "ВнешняяОбработкаОбъект." + ПараметрыВызова.СтрокаПараметровДляВызова;
			
			// Выполняем код в транзакции, которую затем отменяем,
			// чтобы изолировать изменения в базе данных.
			НачатьТранзакцию();
			Попытка
				
				Если ПараметрыВызова.ЭтоФункция Тогда
					// BSLLS:AllowUsingExternalCodeTools
					РезультатВыполнения = Вычислить(СтрокаВызова);
					ИтоговыйРезультат = "Код выполнен. Результат: " + Строка(РезультатВыполнения);
				Иначе
					// BSLLS:AllowUsingExternalCodeTools
					Выполнить(СтрокаВызова);
					ИтоговыйРезультат = "Код выполнен (процедура, без возвращаемого значения).";
				КонецЕсли;
				
				ОтменитьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ВызватьИсключение; // Передаем исключение наверх для стандартной обработки.
				
			КонецПопытки;
			
		Исключение
			// В случае ошибки на любом из этапов (сборка или выполнение) записываем ее в результат
			ИтоговыйРезультат = "ОШИБКА: " + ОписаниеОшибки();
		КонецПопытки;
		
		// Обновляем запись в регистре итоговым результатом
		МенеджерЗаписи = РегистрыСведений.mcp_ОчередьПроверкиКода.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Статус = Перечисления.mcp_СтатусыПроверкиКода.Обработан;
		МенеджерЗаписи.Результат = ИтоговыйРезультат;
		МенеджерЗаписи.ПолноеИмяВременногоФайла = ПутьКФайлу;
		МенеджерЗаписи.Записать();
		
		// Очищаем временный файл epf
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
			Попытка
				УдалитьФайлы(ПутьКФайлу);
			Исключение
				// Игнорируем ошибку, если файл уже удален или недоступен
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	// Очистка старых записей, 
	// для максимального облегчения Регламентного занадия выполняем, только если было новое обращение
	ОчиститьСтарыеЗаписи(); 
	
КонецПроцедуры

// Процедура удаляет старые записи из регистра и связанные с ними файлы.
//
Процедура ОчиститьСтарыеЗаписи()
	
	СекундВМинуте = 60;
	МинутВЧасе = 60;
	ЧасовВДне = 24;
	
	ДатаОчистки = ТекущаяДатаСеанса() - СекундВМинуте * МинутВЧасе * ЧасовВДне; // Удаляем записи старше одного дня
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОчистки", ДатаОчистки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	mcp_ОчередьПроверкиКода.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	mcp_ОчередьПроверкиКода.ПолноеИмяВременногоФайла КАК ПолноеИмяВременногоФайла
	|ИЗ
	|	РегистрСведений.mcp_ОчередьПроверкиКода КАК mcp_ОчередьПроверкиКода
	|ГДЕ
	|	mcp_ОчередьПроверкиКода.ДатаОбращения < &ДатаОчистки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.mcp_ОчередьПроверкиКода.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		// Удаляем файл, если он существует и это не ошибка
		Если ЗначениеЗаполнено(Выборка.ПолноеИмяВременногоФайла) И СтрНайти(Выборка.ПолноеИмяВременногоФайла, "ОШИБКА:") = 0 Тогда
			// В новой логике файлы удаляются сразу, но оставляем этот код для очистки "хвостов" от старой версии
			Попытка

					УдалитьФайлы(Выборка.ПолноеИмяВременногоФайла);

			Исключение
				// Игнорируем ошибки удаления файла, т.к. он мог быть удален ранее.
			КонецПопытки;
		КонецЕсли;
		
		НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(Выборка.УникальныйИдентификатор);
		НаборЗаписей.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

// Формирует строки кода для декларации переменных и их инициализации из JSON-контекста.
// Обрабатывает вложенные свойства объектов.
//
// Параметры:
//  КонтекстJSON - Строка - JSON-строка с контекстом выполнения.
//  ДекларацииПеременных - Строка - (возвращаемое значение) Код объявления переменных.
//  ПрисваиванияВОбработчике - Строка - (возвращаемое значение) Код инициализации и присваивания значений.
//
Процедура СформироватьКодИнициализацииКонтекста(КонтекстJSON, ДекларацииПеременных, ПрисваиванияВОбработчике)
	
	Если ПустаяСтрока(КонтекстJSON) Или КонтекстJSON = "{}" Тогда
		Возврат;
	КонецЕсли;
	
	ОбъявленныеПеременные = Новый Соответствие;
	ИнициализированныеПути = Новый Соответствие;
	
	СтруктураКонтекста = mcp_ОбщегоНазначения.JSONВСтруктуру(КонтекстJSON);
	
	Для Каждого КлючИЗначение Из СтруктураКонтекста Цикл
		
		ИмяПеременной = КлючИЗначение.Ключ;
		ЧастиПути = СтрРазделить(ИмяПеременной, ".");
		
		Если ЧастиПути.Количество() = 1 Тогда
			// Обработка простых переменных
			ДекларацииПеременных = ДекларацииПеременных + "Перем " + ИмяПеременной + ";" + Символы.ПС;
			ПрисваиванияВОбработчике = ПрисваиванияВОбработчике + ИмяПеременной + " = "
				+ mcp_ОбщегоНазначения.ПредставлениеЗначенияДляКода(КлючИЗначение.Значение) + ";" + Символы.ПС;
		Иначе
			// Обработка переменных с вложенными свойствами
			ИмяКорневогоОбъекта = ЧастиПути[0];
			Если ОбъявленныеПеременные[ИмяКорневогоОбъекта] = Неопределено Тогда
				ДекларацииПеременных = ДекларацииПеременных + "Перем " + ИмяКорневогоОбъекта + ";" + Символы.ПС;
				ПрисваиванияВОбработчике = ПрисваиванияВОбработчике + ИмяКорневогоОбъекта + " = Новый Структура;" + Символы.ПС;
				ОбъявленныеПеременные.Вставить(ИмяКорневогоОбъекта, Истина);
			КонецЕсли;
			
			// Создаем промежуточные структуры
			ПутьКРодителю = ИмяКорневогоОбъекта;
			Для Индекс = 1 По ЧастиПути.ВГраница() - 1 Цикл
				ИмяСвойства = ЧастиПути[Индекс];
				ПолныйПуть = ПутьКРодителю + "." + ИмяСвойства;
				
				Если ИнициализированныеПути[ПолныйПуть] = Неопределено Тогда
					ПрисваиванияВОбработчике = ПрисваиванияВОбработчике
						+ "Если " + ПутьКРодителю + ".Свойство(""" + ИмяСвойства + """) = Ложь Тогда" + Символы.ПС
						+ "	" + ПутьКРодителю + ".Вставить(""" + ИмяСвойства + """, Новый Структура);" + Символы.ПС
						+ "КонецЕсли;" + Символы.ПС;
					ИнициализированныеПути.Вставить(ПолныйПуть, Истина);
				КонецЕсли;
				
				ПутьКРодителю = ПолныйПуть;
			КонецЦикла;
			
			// Присваиваем значение последнему свойству
			ИмяПоследнегоСвойства = ЧастиПути[ЧастиПути.ВГраница()];
			ПрисваиванияВОбработчике = ПрисваиванияВОбработчике + ПутьКРодителю + ".Вставить(""" + ИмяПоследнегоСвойства + """, "
				+ mcp_ОбщегоНазначения.ПредставлениеЗначенияДляКода(КлючИЗначение.Значение) + ");" + Символы.ПС;
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция разбирает исходный код модуля, находит сигнатуру указанного метода
// и возвращает его тип (функция/процедура) и список имен параметров.
//
// Параметры:
//  КодМодуля - Строка - исходный код для анализа.
//  ИмяМетода - Строка - имя искомого метода.
//
// Возвращаемое значение:
//  Структура - содержит поля:
//    * ЭтоФункция - Булево - Истина, если метод является функцией.
//    * Параметры - Массив - массив структур с полями "Имя" и "ЗначениеПоУмолчанию".
//  Неопределено - если метод не найден.
//
Функция НайтиСигнатуруМетода(КодМодуля, ИмяМетода)
	
	КодМодуляНРег = НРег(КодМодуля);
	ИмяМетодаНРег = НРег(ИмяМетода);
	
	ЭтоФункция = Ложь;
	
	// Ищем начало определения процедуры или функции.
	// Используется простой текстовый поиск, который может быть неточным в сложных случаях
	// (например, закомментированный код), но достаточен для основной функциональности.
	ПозНачала = 0;
	ПозицияПроцедуры = СтрНайти(КодМодуляНРег, "процедура " + ИмяМетодаНРег);
	ПозицияФункции  = СтрНайти(КодМодуляНРег, "функция " + ИмяМетодаНРег);
	
	Если ПозицияПроцедуры > 0 Тогда
		ПозНачала = ПозицияПроцедуры;
		ЭтоФункция = Ложь;
	ИначеЕсли ПозицияФункции > 0 Тогда
		ПозНачала = ПозицияФункции;
		ЭтоФункция = Истина;
	Иначе
		Возврат Неопределено; // Метод не найден
	КонецЕсли;
	
	// Находим скобки, чтобы извлечь строку с параметрами
	ПозОткрывающейСкобки = СтрНайти(КодМодуля, "(", , ПозНачала);
	Если ПозОткрывающейСкобки = 0 Тогда
		ВызватьИсключение "Некорректная сигнатура метода '" + ИмяМетода + "': не найдена открывающая скобка.";
	КонецЕсли;
	
	ПозЗакрывающейСкобки = СтрНайти(КодМодуля, ")", , ПозОткрывающейСкобки);
	Если ПозЗакрывающейСкобки = 0 Тогда
		ВызватьИсключение "Некорректная сигнатура метода '" + ИмяМетода + "': не найдена закрывающая скобка.";
	КонецЕсли;
	
	СтрокаПараметров = СокрЛП(Сред(КодМодуля, ПозОткрывающейСкобки + 1, ПозЗакрывающейСкобки - ПозОткрывающейСкобки - 1));
	Если ПустаяСтрока(СтрокаПараметров) Тогда
		Возврат Новый Структура("ЭтоФункция, Параметры", ЭтоФункция, Новый Массив);
	КонецЕсли;
	
	// Парсинг строки параметров
	МассивПараметров = Новый Массив;
	СписокПараметров = СтрРазделить(СтрокаПараметров, ",");
	
	Для Каждого ЭлементПараметра Из СписокПараметров Цикл
		ИмяПараметра = "";
		ЗначениеПоУмолчанию = Неопределено;
		
		ПолноеОписаниеПараметра = СокрЛП(ЭлементПараметра);
		
		// Убираем 'Знач' в начале
		Если НРег(Лев(ПолноеОписаниеПараметра, 5)) = "знач " Тогда
			ПолноеОписаниеПараметра = СокрЛП(Сред(ПолноеОписаниеПараметра, 6));
		КонецЕсли;
		
		// Ищем значение по умолчанию
		ПозРавно = СтрНайти(ПолноеОписаниеПараметра, "=");
		Если ПозРавно > 0 Тогда
			ИмяПараметра = СокрП(Лев(ПолноеОписаниеПараметра, ПозРавно - 1));
			ЗначениеПоУмолчанию = СокрЛП(Сред(ПолноеОписаниеПараметра, ПозРавно + 1));
		Иначе
			ИмяПараметра = ПолноеОписаниеПараметра;
		КонецЕсли;
		
		// Имя параметра - это первое слово в строке (на случай если есть тип `Новый ...`)
		ПозПробела = СтрНайти(ИмяПараметра, " ");
		Если ПозПробела > 0 Тогда
			ИмяПараметра = Лев(ИмяПараметра, ПозПробела - 1);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ИмяПараметра) Тогда
			МассивПараметров.Добавить(Новый Структура("Имя, ЗначениеПоУмолчанию", ИмяПараметра, ЗначениеПоУмолчанию));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ЭтоФункция, Параметры", ЭтоФункция, МассивПараметров);
	
КонецФункции

// Функция формирует строку вызова метода с параметрами на основе контекста.
//
// Параметры:
//  КодМодуля - Строка - исходный код для анализа.
//  ИмяМетода - Строка - имя вызываемого метода.
//  КонтекстJSON - Строка - JSON-строка с параметрами.
//
// Возвращаемое значение:
//  Структура - содержит поля:
//   * ЭтоФункция - Булево - Истина, если метод является функцией.
//   * СтрокаПараметровДляВызова - Строка - готовая строка для вызова, например "МойМетод('параметр1', 123)".
//
Функция СформироватьПараметрыВызова(КодМодуля, ИмяМетода, КонтекстJSON)
	
	Сигнатура = НайтиСигнатуруМетода(КодМодуля, ИмяМетода);
	Если Сигнатура = Неопределено Тогда
		ВызватьИсключение "Метод '" + ИмяМетода + "' не найден в предоставленном коде.";
	КонецЕсли;
	
	СтруктураКонтекста = Новый Структура;
	Если ЗначениеЗаполнено(КонтекстJSON) Тогда
		Попытка
			СтруктураКонтекста = mcp_ОбщегоНазначения.JSONВСтруктуру(КонтекстJSON);
		Исключение
			ВызватьИсключение "Ошибка разбора JSON в параметре context: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	МассивАргументов = Новый Массив;
	Для Каждого ОписаниеПараметра Из Сигнатура.Параметры Цикл
		
		ИмяПараметра = ОписаниеПараметра.Имя;
		
		Если СтруктураКонтекста.Свойство(ИмяПараметра) Тогда
			// Параметр передан в контексте, используем его значение
			ЗначениеПараметра = СтруктураКонтекста[ИмяПараметра];
			МассивАргументов.Добавить(mcp_ОбщегоНазначения.ПредставлениеЗначенияДляКода(ЗначениеПараметра));
		ИначеЕсли ОписаниеПараметра.ЗначениеПоУмолчанию <> Неопределено Тогда
			// Параметр не передан, но есть значение по умолчанию
			МассивАргументов.Добавить(ОписаниеПараметра.ЗначениеПоУмолчанию);
		Иначе
			// Параметр обязателен, но не передан и нет значения по умолчанию
			ВызватьИсключение "Обязательный параметр '" + ИмяПараметра + "' для метода '" + ИмяМетода + "' отсутствует в context.";
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаПараметровДляВызова = ИмяМетода + "(" + СтрСоединить(МассивАргументов, ", ") + ")";
	
	Возврат Новый Структура("ЭтоФункция, СтрокаПараметровДляВызова", Сигнатура.ЭтоФункция, СтрокаПараметровДляВызова);
	
КонецФункции

// ОТКЛЮЧЕНА
// Функция добавляет ключевое слово "Экспорт" к сигнатуре метода в коде.
//
// Параметры:
//  ИсходныйКод - Строка - код, в котором нужно модифицировать метод.
//  ИмяМетода  - Строка - имя метода (процедуры или функции).
//
// Возвращаемое значение:
//  Строка - модифицированный код.
//
Функция ДобавитьЭкспортКМетоду(ИсходныйКод, ИмяМетода)
	
	ИсходныйКодНРег = НРег(ИсходныйКод);
	ИмяМетодаНРег = НРег(ИмяМетода);
	
	// Ищем определение процедуры или функции
	ПозНачалаПроцедуры = СтрНайти(ИсходныйКодНРег, "процедура " + ИмяМетодаНРег);
	ПозНачалаФункции = СтрНайти(ИсходныйКодНРег, "функция " + ИмяМетодаНРег);
	
	ПозНачала = 0;
	Если ПозНачалаПроцедуры > 0 Тогда
		ПозНачала = ПозНачалаПроцедуры;
	ИначеЕсли ПозНачалаФункции > 0 Тогда
		ПозНачала = ПозНачалаФункции;
	Иначе
		Возврат ИсходныйКод; // Метод не найден, ничего не делаем
	КонецЕсли;
	
	// Находим закрывающую скобку сигнатуры
	ПозЗакрывающейСкобки = СтрНайти(ИсходныйКод, ")", , ПозНачала);
	Если ПозЗакрывающейСкобки = 0 Тогда
		Возврат ИсходныйКод; // Некорректная сигнатура
	КонецЕсли;
	
	// Проверяем, есть ли уже "Экспорт" в оставшейся части строки
	ПозКонцаСтроки = СтрНайти(ИсходныйКод, Символы.ПС, , ПозЗакрывающейСкобки);
	Если ПозКонцаСтроки = 0 Тогда
		// Это может быть последняя строка в коде
		ПозКонцаСтроки = СтрДлина(ИсходныйКод) + 1;
	КонецЕсли;
	
	ЧастьПослеСкобок = Сред(ИсходныйКод, ПозЗакрывающейСкобки + 1, ПозКонцаСтроки - (ПозЗакрывающейСкобки + 1));
	Если СтрНайти(НРег(ЧастьПослеСкобок), "экспорт") > 0 Тогда
		Возврат ИсходныйКод; // Экспорт уже есть
	КонецЕсли;
	
	// Вставляем "Экспорт" после закрывающей скобки
	Возврат Лев(ИсходныйКод, ПозЗакрывающейСкобки) + " Экспорт" + Сред(ИсходныйКод, ПозЗакрывающейСкобки + 1);
	
КонецФункции

// Функция для сборки файла .epf. Адаптирована для серверного вызова.
//
// Параметры:
//  ТекстМодуля      - Строка - исходный код для модуля объекта.
//  ИмяОбработки     - Строка - уникальное имя для создаваемой обработки.
//
// Возвращаемое значение:
//   Строка - полный путь к созданному файлу .epf.
//
Функция СоздатьФайлEPF(ТекстМодуля, ИмяОбработки)
	
	ПутьК1cv8exe = КаталогПрограммы() + "1cv8.exe";
	
	ПроверяемыйФайл = Новый Файл(ПутьК1cv8exe);
	Если Не ПроверяемыйФайл.Существует() Тогда
		ВызватьИсключение "Не найден исполняемый файл 1С:Предприятие: " + ПутьК1cv8exe;
	КонецЕсли;
	
	ИмяГлавногоВременногоКаталога = ПолучитьИмяВременногоФайла();
	УдалитьФайлы(ИмяГлавногоВременногоКаталога);
	СоздатьКаталог(ИмяГлавногоВременногоКаталога);
	
	ПутьКИБ = ИмяГлавногоВременногоКаталога + "\ib\";
	ПутьКXml = ИмяГлавногоВременногоКаталога + "\xml\";
	ПутьКВыходномуКаталогу = ИмяГлавногоВременногоКаталога + "\out\";
	
	СоздатьКаталог(ПутьКИБ);
	СоздатьКаталог(ПутьКXml);
	СоздатьКаталог(ПутьКВыходномуКаталогу);
	
	// BSLLS:AllowUsingTempFilesDir
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла("epf");
	// BSLLS:AllowUsingTempFilesDir
	
	Результат = "";
	
	Попытка
		// 1. Готовим исходные файлы в каталоге xml.
		ТекстXMLШаблон = "<?xml version=""1.0"" encoding=""UTF-8""?>
		|<MetaDataObject xmlns=""http://v8.1c.ru/8.3/MDClasses"" xmlns:app=""http://v8.1c.ru/8.2/managed-application/core"" xmlns:cfg=""http://v8.1c.ru/8.1/data/enterprise/current-config"" xmlns:cmi=""http://v8.1c.ru/8.2/managed-application/cmi"" xmlns:ent=""http://v8.1c.ru/8.1/data/enterprise"" xmlns:lf=""http://v8.1c.ru/8.2/managed-application/logform"" xmlns:style=""http://v8.1c.ru/8.1/data/ui/style"" xmlns:sys=""http://v8.1c.ru/8.1/data/ui/fonts/system"" xmlns:v8=""http://v8.1c.ru/8.1/data/core"" xmlns:v8ui=""http://v8.1c.ru/8.1/data/ui"" xmlns:web=""http://v8.1c.ru/8.1/data/ui/colors/web"" xmlns:win=""http://v8.1c.ru/8.1/data/ui/colors/windows"" xmlns:xen=""http://v8.1c.ru/8.3/xcf/enums"" xmlns:xpr=""http://v8.1c.ru/8.3/xcf/predef"" xmlns:xr=""http://v8.1c.ru/8.3/xcf/readable"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" version=""2.19"">
		|	<ExternalDataProcessor uuid=""%uuid_main%"">
		|		<InternalInfo>
		|			<xr:ContainedObject>
		|				<xr:ClassId>c3831ec8-d8d5-4f93-8a22-f9bfae07327f</xr:ClassId>
		|				<xr:ObjectId>%uuid_object%</xr:ObjectId>
		|			</xr:ContainedObject>
		|			<xr:GeneratedType name=""ExternalDataProcessorObject.%ИмяОбработки%"" category=""Object"">
		|				<xr:TypeId>%uuid_type%</xr:TypeId>
		|				<xr:ValueId>%uuid_value%</xr:ValueId>
		|			</xr:GeneratedType>
		|		</InternalInfo>
		|		<Properties>
		|			<Name>%ИмяОбработки%</Name>
		|			<Synonym>
		|				<v8:item>
		|					<v8:lang>ru</v8:lang>
		|					<v8:content>%ИмяОбработки%</v8:content>
		|				</v8:item>
		|			</Synonym>
		|			<Comment/>
		|			<DefaultForm/>
		|			<AuxiliaryForm/>
		|		</Properties>
		|		<ChildObjects>
		|			<ObjectModule uuid=""%uuid_module%"">
		|				<InternalInfo>
		|					<xr:ContainedObject>
		|						<xr:ClassId>d5b99f7c-8386-41c2-921c-333a65851421</xr:ClassId>
		|						<xr:ObjectId>%uuid_module_object%</xr:ObjectId>
		|					</xr:ContainedObject>
		|					<xr:GeneratedType name=""ExternalDataProcessorObjectModule.%ИмяОбработки%"" category=""Module"">
		|						<xr:TypeId>%uuid_module_type%</xr:TypeId>
		|						<xr:ValueId>%uuid_module_value%</xr:ValueId>
		|					</xr:GeneratedType>
		|				</InternalInfo>
		|				<Properties>
		|					<Name>МодульОбъекта</Name>
		|					<Synonym>
		|						<v8:item>
		|							<v8:lang>ru</v8:lang>
		|							<v8:content>Модуль объекта</v8:content>
		|						</v8:item>
		|					</Synonym>
		|					<Comment/>
		|				</Properties>
		|			</ObjectModule>
		|		</ChildObjects>
		|	</ExternalDataProcessor>
		|</MetaDataObject>";
		
		ТекстXMLШаблон = СтрЗаменить(ТекстXMLШаблон, "%ИмяОбработки%", ИмяОбработки);
		
		ПутьККаталогуОбработки = ПутьКXml + ИмяОбработки + "\";
		СоздатьКаталог(ПутьККаталогуОбработки);
		СоздатьКаталог(ПутьККаталогуОбработки + "Ext\");
		
		ТекстXML = СтрЗаменить(ТекстXMLШаблон, "%uuid_main%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_object%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_type%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_value%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_module%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_module_object%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_module_type%", Новый УникальныйИдентификатор());
		ТекстXML = СтрЗаменить(ТекстXML, "%uuid_module_value%", Новый УникальныйИдентификатор());
		
		ИмяВременногоКорневогоФайла = ПутьКXml + ИмяОбработки + ".xml";
		
		ТекстовыйДокументXML = Новый ТекстовыйДокумент;
		ТекстовыйДокументXML.УстановитьТекст(ТекстXML);
		ТекстовыйДокументXML.Записать(ИмяВременногоКорневогоФайла, КодировкаТекста.UTF8);
		
		ИмяВременногоФайлаМодуля = ПутьККаталогуОбработки + "Ext\ObjectModule.bsl";
		
		ТекстовыйДокументМодуля = Новый ТекстовыйДокумент;
		ТекстовыйДокументМодуля.УстановитьТекст(ТекстМодуля);
		ТекстовыйДокументМодуля.Записать(ИмяВременногоФайлаМодуля, КодировкаТекста.UTF8);
		
		// 2. Создаем временную пустую информационную базу.
		КомандаСозданияИБ = СтрШаблон("""%1"" CREATEINFOBASE File=""%2""", ПутьК1cv8exe, ПутьКИБ);
		// BSLLS:AllowExternalAppStarting
		ЗапуститьПриложение(КомандаСозданияИБ, , Истина);
		// BSLLS:AllowExternalAppStarting
		
		// 3. Собираем epf с помощью 1cv8.exe DESIGNER.
		КомандаСборкиEPF = СтрШаблон(
			"""%1"" DESIGNER /IBConnectionString ""File=%2"" /LoadExternalDataProcessorOrReportFromFiles ""%3"" ""%4""",
			ПутьК1cv8exe,
			ПутьКИБ,
			ИмяВременногоКорневогоФайла,
			ПолноеИмяФайла
		);
		// BSLLS:AllowExternalAppStarting
		ЗапуститьПриложение(КомандаСборкиEPF, , Истина);
		// BSLLS:AllowExternalAppStarting
		
		// 4. Проверяем результат.
		ФайлРезультат = Новый Файл(ПолноеИмяФайла);
		Если ФайлРезультат.Существует() Тогда
			Результат = ПолноеИмяФайла;
		Иначе
			ВызватьИсключение "Не удалось собрать .epf файл. Выходной файл не найден: " + ПолноеИмяФайла;
		КонецЕсли;
		
	Исключение
		ВызватьИсключение "Критическая ошибка при создании файла EPF: " + ОписаниеОшибки();
	КонецПопытки;
	
	// 5. Очистка временных файлов и каталога.
	УдалитьФайлы(ИмяГлавногоВременногоКаталога, Истина);
	
	Возврат Результат;
	
КонецФункции
